{"version":"1.0","truncation":{"max_length":256,"strategy":"LongestFirst","stride":0},"padding":{"strategy":"BatchLongest","direction":"Right","pad_to_multiple_of":8,"pad_id":3,"pad_type_id":0,"pad_token":"[PAD]"},"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[BOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[EOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Punctuation"},"post_processor":{"type":"TemplateProcessing","single":[{"SpecialToken":{"id":"[BOS]","type_id":0}},{"Sequence":{"id":"A","type_id":0}},{"SpecialToken":{"id":"[EOS]","type_id":0}}],"pair":[{"Sequence":{"id":"A","type_id":0}},{"Sequence":{"id":"B","type_id":1}}],"special_tokens":{"[BOS]":{"id":"[BOS]","ids":[1],"tokens":["[BOS]"]},"[EOS]":{"id":"[EOS]","ids":[2],"tokens":["[EOS]"]}}},"decoder":{"type":"WordPiece","prefix":"##","cleanup":true},"model":{"type":"WordPiece","unk_token":"[UNK]","continuing_subword_prefix":"##","max_input_chars_per_word":100,"vocab":{"[UNK]":0,"[BOS]":1,"[EOS]":2,"[PAD]":3,"(":4,")":5,"+":6,",":7,"-":8,"/":9,"0":10,"1":11,"2":12,"3":13,"4":14,"5":15,"6":16,"7":17,"8":18,"9":19,"=":20,"B":21,"C":22,"D":23,"F":24,"H":25,"I":26,"N":27,"O":28,"P":29,"S":30,"T":31,"b":32,"c":33,"h":34,"i":35,"l":36,"m":37,"n":38,"r":39,"s":40,"t":41,"##6":42,"##H":43,"##1":44,"##2":45,"##N":46,"##O":47,"##S":48,"##7":49,"##F":50,"##3":51,"##4":52,"##0":53,"##C":54,"##l":55,"##B":56,"##r":57,"##5":58,"##8":59,"##9":60,"##P":61,"##I":62,"##D":63,"##i":64,"##T":65,"##n":66,"##h":67,"11":68,"12":69,"10":70,"13":71,"14":72,"15":73,"16":74,"##H2":75,"17":76,"18":77,"19":78,"1S":79,"In":80,"##Ch":81,"InCh":82,"InChI":83,"20":84,"c1":85,"##H3":86,"21":87,"22":88,"23":89,"24":90,"C1":91,"25":92,"26":93,"27":94,"28":95,"##H1":96,"29":97,"C2":98,"30":99,"1H3":100,"##N2":101,"31":102,"##O2":103,"2H3":104,"##N3":105,"h1":106,"32":107,"##O3":108,"h3":109,"33":110,"##Cl":111,"s1":112,"h2":113,"3H3":114,"34":115,"h4":116,"##N4":117,"##O4":118,"35":119,"h5":120,"t1":121,"36":122,"H2":123,"m0":124,"37":125,"11H2":126,"4H3":127,"10H2":128,"##Br":129,"m1":130,"12H2":131,"##N2O":132,"C15":133,"##O2S":134,"C14":135,"9H2":136,"##N5":137,"h6":138,"C16":139,"##O3S":140,"13H2":141,"C13":142,"38":143,"##N3O":144,"C17":145,"14H":146,"14H2":147,"8H2":148,"15H":149,"13H":150,"c2":151,"16H":152,"C18":153,"12H":154,"##H20":155,"17H":156,"C12":157,"##H19":158,"##H22":159,"##H18":160,"##H21":161,"##NO":162,"C19":163,"39":164,"11H":165,"15H2":166,"C20":167,"##H23":168,"18H":169,"##H17":170,"10H":171,"##O4S":172,"h7":173,"7H2":174,"##H24":175,"##H16":176,"C21":177,"##F3":178,"40":179,"16H2":180,"9H":181,"C11":182,"##N4O":183,"##N2O2":184,"C22":185,"19H":186,"##H25":187,"##H15":188,"##H26":189,"8H":190,"C3":191,"##H14":192,"6H2":193,"##N3O2":194,"C23":195,"41":196,"##N2O3":197,"h8":198,"20H":199,"17H2":200,"##Cl2":201,"t2":202,"5H3":203,"##F2":204,"##H27":205,"##N6":206,"C24":207,"##H13":208,"C10":209,"7H":210,"##H28":211,"##NO2":212,"42":213,"b1":214,"##N3O3":215,"##H12":216,"##5S":217,"21H":218,"h9":219,"C25":220,"##NO3":221,"5H2":222,"18H2":223,"##N4O2":224,"##N5O":225,"##H29":226,"43":227,"22H":228,"6H":229,"C26":230,"##H30":231,"##N2O4":232,"##H11":233,"##N2O3S":234,"h10":235,"C9":236,"23H":237,"##N2O2S":238,"4H2":239,"44":240,"b2":241,"##N3O2S":242,"##ClF":243,"##N3O3S":244,"C27":245,"19H2":246,"24H":247,"##H4":248,"##H10":249,"##NO4":250,"##N4O3":251,"##H31":252,"h11":253,"##N2O4S":254,"##H32":255}}}